FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_IAR/system_and_ST_code/STM32L152_EVAL/stm32l152_eval_lcd.c
        /* Set GRAM area ---------------------------------------------------------*/
        LCD_WriteReg( LCD_REG_80, 0x0000 );  /* Horizontal GRAM Start Address */
        LCD_WriteReg( LCD_REG_81, 0x00EF );  /* Horizontal GRAM End Address */
        LCD_WriteReg( LCD_REG_82, 0x0000 );  /* Vertical GRAM Start Address */
        LCD_WriteReg( LCD_REG_83, 0x013F );  /* Vertical GRAM End Address */
        LCD_WriteReg( LCD_REG_96, 0x2700 );  /* Gate Scan Line */
        LCD_WriteReg( LCD_REG_97, 0x0001 );  /* NDL,VLE, REV */
        LCD_WriteReg( LCD_REG_106, 0x0000 ); /* set scrolling line */
        /* Partial Display Control -----------------------------------------------*/
        LCD_WriteReg( LCD_REG_128, 0x0000 );
        LCD_WriteReg( LCD_REG_129, 0x0000 );
        LCD_WriteReg( LCD_REG_130, 0x0000 );
        LCD_WriteReg( LCD_REG_131, 0x0000 );
        LCD_WriteReg( LCD_REG_132, 0x0000 );
        LCD_WriteReg( LCD_REG_133, 0x0000 );
        /* Panel Control ---------------------------------------------------------*/
        LCD_WriteReg( LCD_REG_144, 0x0010 );
        LCD_WriteReg( LCD_REG_146, 0x0000 );
        LCD_WriteReg( LCD_REG_147, 0x0003 );
        LCD_WriteReg( LCD_REG_149, 0x0110 );
        LCD_WriteReg( LCD_REG_151, 0x0000 );
        LCD_WriteReg( LCD_REG_152, 0x0000 );
        /* Set GRAM write direction and BGR = 1 */
        /* I/D=01 (Horizontal : increment, Vertical : decrement) */
        /* AM=1 (address is updated in vertical writing direction) */
        LCD_WriteReg( LCD_REG_3, 0x1018 );
        LCD_WriteReg( LCD_REG_7, 0x0173 ); /* 262K color and display ON */
    }
}


/**
 * @brief  Initializes the LCD.
 * @param  None
 * @retval None
 */
void STM32L152_LCD_Init( void )
{
    /* Setups the LCD */
    LCD_Setup();

    /* Try to read new LCD controller ID 0x5408 */
    if( LCD_ReadReg( LCD_REG_0 ) == LCD_SPFD5408 )
    {
        LCDType = LCD_SPFD5408;
    }
    else
    {
        LCDType = LCD_ILI9320;
        /* Setups the LCD */
        LCD_Setup();
    }

    LCD_SetFont( &LCD_DEFAULT_FONT );
}

/**
 * @brief  Sets the LCD Text and Background colors.
 * @param  _TextColor: specifies the Text Color.
 * @param  _BackColor: specifies the Background Color.
 * @retval None
 */
void LCD_SetColors( __IO uint16_t _TextColor,
                    __IO uint16_t _BackColor )
{
    TextColor = _TextColor;
    BackColor = _BackColor;
}

/**
 * @brief  Gets the LCD Text and Background colors.
 * @param  _TextColor: pointer to the variable that will contain the Text
 *          Color.
 * @param  _BackColor: pointer to the variable that will contain the Background
 *          Color.
 * @retval None
 */
void LCD_GetColors( __IO uint16_t * _TextColor,
                    __IO uint16_t * _BackColor )
{
    *_TextColor = TextColor;
    *_BackColor = BackColor;
}

/**
 * @brief  Sets the Text color.
 * @param  Color: specifies the Text color code RGB(5-6-5).
 * @retval None
 */
void LCD_SetTextColor( __IO uint16_t Color )
{
    TextColor = Color;
}


/**
 * @brief  Sets the Background color.
 * @param  Color: specifies the Background color code RGB(5-6-5).
 * @retval None
 */
void LCD_SetBackColor( __IO uint16_t Color )
{
    BackColor = Color;
}

/**
 * @brief  Sets the Text Font.
 * @param  fonts: specifies the font to be used.
 * @retval None
 */
void LCD_SetFont( sFONT * fonts )
{
    LCD_Currentfonts = fonts;
}

/**
 * @brief  Gets the Text Font.
 * @param  None.
 * @retval the used font.
 */
sFONT * LCD_GetFont( void )
{
    return LCD_Currentfonts;
}

/**
 * @brief  Clears the selected line.
 * @param  Line: the Line to be cleared.
 *   This parameter can be one of the following values:
 *     @arg Linex: where x can be 0..n
 * @retval None
 */
void LCD_ClearLine( uint8_t Line )
{
    uint16_t refcolumn = LCD_PIXEL_WIDTH - 1;

    /* Send the string character by character on lCD */
    while( ( ( refcolumn + 1 ) & 0xFFFF ) >= LCD_Currentfonts->Width )
    {
        /* Display one character on LCD */
        LCD_DisplayChar( Line, refcolumn, ' ' );
        /* Decrement the column position by 16 */
        refcolumn -= LCD_Currentfonts->Width;
    }
}


/**
 * @brief  Clears the hole LCD.
 * @param  Color: the color of the background.
 * @retval None
 */
void LCD_Clear( uint16_t Color )
{
    uint32_t index = 0;

    LCD_SetCursor( 0x00, 0x013F );

    LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */

    for( index = 0; index < 76800; index++ )
    {
        LCD_WriteRAM( Color );
    }

    LCD_CtrlLinesWrite( LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET );
}


/**
 * @brief  Sets the cursor position.
 * @param  Xpos: specifies the X position.
 * @param  Ypos: specifies the Y position.
 * @retval None
 */
void LCD_SetCursor( uint8_t Xpos,
                    uint16_t Ypos )
{
    LCD_WriteReg( LCD_REG_32, Xpos );
    LCD_WriteReg( LCD_REG_33, Ypos );
}


/**
 * @brief  Draws a character on LCD.
 * @param  Xpos: the Line where to display the character shape.
 * @param  Ypos: start column address.
 * @param  c: pointer to the character data.
 * @retval None
 */
void LCD_DrawChar( uint8_t Xpos,
                   uint16_t Ypos,
                   const uint16_t * c )
{
    uint32_t index = 0, i = 0;
    uint8_t Xaddress = 0;

    Xaddress = Xpos;

    LCD_SetCursor( Xaddress, Ypos );

    for( index = 0; index < LCD_Currentfonts->Height; index++ )
    {
        LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */

        for( i = 0; i < LCD_Currentfonts->Width; i++ )
        {
            if( ( ( ( c[ index ] & ( ( 0x80 << ( ( LCD_Currentfonts->Width / 12 ) * 8 ) ) >> i ) ) == 0x00 ) && ( LCD_Currentfonts->Width <= 12 ) ) ||
                ( ( ( c[ index ] & ( 0x1 << i ) ) == 0x00 ) && ( LCD_Currentfonts->Width > 12 ) ) )

            {
                LCD_WriteRAM( BackColor );
            }
            else
            {
                LCD_WriteRAM( TextColor );
            }
        }

        LCD_CtrlLinesWrite( LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET );
        Xaddress++;
        LCD_SetCursor( Xaddress, Ypos );
    }
}


/**
 * @brief  Displays one character (16dots width, 24dots height).
 * @param  Line: the Line where to display the character shape .
 *   This parameter can be one of the following values:
 *     @arg Linex: where x can be 0..9
 * @param  Column: start column address.
 * @param  Ascii: character ascii code, must be between 0x20 and 0x7E.
 * @retval None
 */
void LCD_DisplayChar( uint8_t Line,
                      uint16_t Column,
                      uint8_t Ascii )
{
    Ascii -= 32;
    LCD_DrawChar( Line, Column, &LCD_Currentfonts->table[ Ascii * LCD_Currentfonts->Height ] );
}


/**
 * @brief  Displays a maximum of 20 char on the LCD.
 * @param  Line: the Line where to display the character shape .
 *   This parameter can be one of the following values:
 *     @arg Linex: where x can be 0..9
 * @param  *ptr: pointer to string to display on LCD.
 * @retval None
 */
void LCD_DisplayStringLine( uint8_t Line,
                            uint8_t * ptr )
{
    uint16_t refcolumn = LCD_PIXEL_WIDTH - 1;

    /* Send the string character by character on lCD */
    while( ( *ptr != 0 ) & ( ( ( refcolumn + 1 ) & 0xFFFF ) >= LCD_Currentfonts->Width ) )
    {
        /* Display one character on LCD */
        LCD_DisplayChar( Line, refcolumn, *ptr );
        /* Decrement the column position by 16 */
        refcolumn -= LCD_Currentfonts->Width;
        /* Point on the next character */
        ptr++;
    }
}


/**
 * @brief  Sets a display window
 * @param  Xpos: specifies the X buttom left position.
 * @param  Ypos: specifies the Y buttom left position.
 * @param  Height: display window height.
 * @param  Width: display window width.
 * @retval None
 */
void LCD_SetDisplayWindow( uint8_t Xpos,
                           uint16_t Ypos,
                           uint8_t Height,
                           uint16_t Width )
{
    /* Horizontal GRAM Start Address */
    if( Xpos >= Height )
    {
        LCD_WriteReg( LCD_REG_80, ( Xpos - Height + 1 ) );
    }
    else
    {
        LCD_WriteReg( LCD_REG_80, 0 );
    }

    /* Horizontal GRAM End Address */
    LCD_WriteReg( LCD_REG_81, Xpos );

    /* Vertical GRAM Start Address */
    if( Ypos >= Width )
    {
        LCD_WriteReg( LCD_REG_82, ( Ypos - Width + 1 ) );
    }
    else
    {
        LCD_WriteReg( LCD_REG_82, 0 );
    }

