FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_IAR/system_and_ST_code/STM32L152_EVAL/stm32l152_eval_lcd.c
    /* Vertical GRAM End Address */
    LCD_WriteReg( LCD_REG_83, Ypos );

    LCD_SetCursor( Xpos, Ypos );
}


/**
 * @brief  Disables LCD Window mode.
 * @param  None
 * @retval None
 */
void LCD_WindowModeDisable( void )
{
    LCD_SetDisplayWindow( 239, 0x13F, 240, 320 );
    LCD_WriteReg( LCD_REG_3, 0x1018 );
}

/**
 * @brief  Displays a line.
 * @param  Xpos: specifies the X position.
 * @param  Ypos: specifies the Y position.
 * @param  Length: line length.
 * @param  Direction: line direction.
 *   This parameter can be one of the following values: Vertical or Horizontal.
 * @retval None
 */
void LCD_DrawLine( uint8_t Xpos,
                   uint16_t Ypos,
                   uint16_t Length,
                   uint8_t Direction )
{
    uint32_t i = 0;

    LCD_SetCursor( Xpos, Ypos );

    if( Direction == LCD_DIR_HORIZONTAL )
    {
        LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */

        for( i = 0; i < Length; i++ )
        {
            LCD_WriteRAM( TextColor );
        }

        LCD_CtrlLinesWrite( LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET );
    }
    else
    {
        for( i = 0; i < Length; i++ )
        {
            LCD_WriteRAMWord( TextColor );
            Xpos++;
            LCD_SetCursor( Xpos, Ypos );
        }
    }
}


/**
 * @brief  Displays a rectangle.
 * @param  Xpos: specifies the X position.
 * @param  Ypos: specifies the Y position.
 * @param  Height: display rectangle height.
 * @param  Width: display rectangle width.
 * @retval None
 */
void LCD_DrawRect( uint8_t Xpos,
                   uint16_t Ypos,
                   uint8_t Height,
                   uint16_t Width )
{
    LCD_DrawLine( Xpos, Ypos, Width, LCD_DIR_HORIZONTAL );
    LCD_DrawLine( ( Xpos + Height ), Ypos, Width, LCD_DIR_HORIZONTAL );

    LCD_DrawLine( Xpos, Ypos, Height, LCD_DIR_VERTICAL );
    LCD_DrawLine( Xpos, ( Ypos - Width + 1 ), Height, LCD_DIR_VERTICAL );
}


/**
 * @brief  Displays a circle.
 * @param  Xpos: specifies the X position.
 * @param  Ypos: specifies the Y position.
 * @param  Radius
 * @retval None
 */
void LCD_DrawCircle( uint8_t Xpos,
                     uint16_t Ypos,
                     uint16_t Radius )
{
    int32_t D;     /* Decision Variable */
    uint32_t CurX; /* Current X Value */
    uint32_t CurY; /* Current Y Value */

    D = 3 - ( Radius << 1 );
    CurX = 0;
    CurY = Radius;

    while( CurX <= CurY )
    {
        LCD_SetCursor( Xpos + CurX, Ypos + CurY );
        LCD_WriteRAMWord( TextColor );
        LCD_SetCursor( Xpos + CurX, Ypos - CurY );
        LCD_WriteRAMWord( TextColor );

        LCD_SetCursor( Xpos - CurX, Ypos + CurY );
        LCD_WriteRAMWord( TextColor );

        LCD_SetCursor( Xpos - CurX, Ypos - CurY );
        LCD_WriteRAMWord( TextColor );

        LCD_SetCursor( Xpos + CurY, Ypos + CurX );
        LCD_WriteRAMWord( TextColor );

        LCD_SetCursor( Xpos + CurY, Ypos - CurX );
        LCD_WriteRAMWord( TextColor );

        LCD_SetCursor( Xpos - CurY, Ypos + CurX );
        LCD_WriteRAMWord( TextColor );

        LCD_SetCursor( Xpos - CurY, Ypos - CurX );
        LCD_WriteRAMWord( TextColor );

        if( D < 0 )
        {
            D += ( CurX << 2 ) + 6;
        }
        else
        {
            D += ( ( CurX - CurY ) << 2 ) + 10;
            CurY--;
        }

        CurX++;
    }
}


/**
 * @brief  Displays a monocolor picture.
 * @param  Pict: pointer to the picture array.
 * @retval None
 */
void LCD_DrawMonoPict( const uint32_t * Pict )
{
    uint32_t index = 0, i = 0;

    LCD_SetCursor( 0, ( LCD_PIXEL_WIDTH - 1 ) );

    LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */

    for( index = 0; index < 2400; index++ )
    {
        for( i = 0; i < 32; i++ )
        {
            if( ( Pict[ index ] & ( 1 << i ) ) == 0x00 )
            {
                LCD_WriteRAM( BackColor );
            }
            else
            {
                LCD_WriteRAM( TextColor );
            }
        }
    }

    LCD_CtrlLinesWrite( LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET );
}

#ifdef USE_LCD_DrawBMP

/**
 * @brief  Displays a bitmap picture loaded in the SPI Flash.
 * @param  BmpAddress: Bmp picture address in the SPI Flash.
 * @retval None
 */
    void LCD_DrawBMP( uint32_t BmpAddress )
    {
        uint32_t i = 0, size = 0;

        /* Read bitmap size */
        SPI_FLASH_BufferRead( ( uint8_t * ) &size, BmpAddress + 2, 4 );
        /* get bitmap data address offset */
        SPI_FLASH_BufferRead( ( uint8_t * ) &i, BmpAddress + 10, 4 );

        size = ( size - i ) / 2;
        SPI_FLASH_StartReadSequence( BmpAddress + i );
        /* Disable SPI1  */
        SPI_Cmd( SPI1, DISABLE );
        /* SPI in 16-bit mode */
        SPI_DataSizeConfig( SPI1, SPI_DataSize_16b );
        /* Enable SPI1  */
        SPI_Cmd( SPI1, ENABLE );

        if( ( LCDType == LCD_ILI9320 ) || ( LCDType == LCD_SPFD5408 ) )
        {
            /* Set GRAM write direction and BGR = 1 */
            /* I/D=00 (Horizontal : decrement, Vertical : decrement) */
            /* AM=1 (address is updated in vertical writing direction) */
            LCD_WriteReg( LCD_REG_3, 0x1008 );
            LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
        }

        /* Read bitmap data from SPI Flash and send them to LCD */
        for( i = 0; i < size; i++ )
        {
            LCD_WriteRAM( __REV16( SPI_FLASH_SendHalfWord( 0xA5A5 ) ) );
        }

        if( ( LCDType == LCD_ILI9320 ) || ( LCDType == LCD_SPFD5408 ) )
        {
            LCD_CtrlLinesWrite( LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET );
        }

        /* Deselect the FLASH: Chip Select high */
        SPI_FLASH_CS_HIGH();
        /* Disable SPI1  */
        SPI_Cmd( SPI1, DISABLE );
        /* SPI in 8-bit mode */
        SPI_DataSizeConfig( SPI1, SPI_DataSize_8b );
        /* Enable SPI1  */
        SPI_Cmd( SPI1, ENABLE );

        if( ( LCDType == LCD_ILI9320 ) || ( LCDType == LCD_SPFD5408 ) )
        {
            /* Set GRAM write direction and BGR = 1 */
            /* I/D = 01 (Horizontal : increment, Vertical : decrement) */
            /* AM = 1 (address is updated in vertical writing direction) */
            LCD_WriteReg( LCD_REG_3, 0x1018 );
        }
    }
#endif /* USE_LCD_DrawBMP */

/**
 * @brief  Displays a full rectangle.
 * @param  Xpos: specifies the X position.
 * @param  Ypos: specifies the Y position.
 * @param  Height: rectangle height.
 * @param  Width: rectangle width.
 * @retval None
 */
void LCD_DrawFullRect( uint16_t Xpos,
                       uint16_t Ypos,
                       uint16_t Width,
                       uint16_t Height )
{
    LCD_SetTextColor( TextColor );

