FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_IAR/system_and_ST_code/STM32L152_EVAL/stm32l152_eval_lcd.c
    LCD_DrawLine( Xpos, Ypos, Width, LCD_DIR_HORIZONTAL );
    LCD_DrawLine( ( Xpos + Height ), Ypos, Width, LCD_DIR_HORIZONTAL );

    LCD_DrawLine( Xpos, Ypos, Height, LCD_DIR_VERTICAL );
    LCD_DrawLine( Xpos, ( Ypos - Width + 1 ), Height, LCD_DIR_VERTICAL );

    Width -= 2;
    Height--;
    Ypos--;

    LCD_SetTextColor( BackColor );

    while( Height-- )
    {
        LCD_DrawLine( ++Xpos, Ypos, Width, LCD_DIR_HORIZONTAL );
    }

    LCD_SetTextColor( TextColor );
}

/**
 * @brief  Displays a full circle.
 * @param  Xpos: specifies the X position.
 * @param  Ypos: specifies the Y position.
 * @param  Radius
 * @retval None
 */
void LCD_DrawFullCircle( uint16_t Xpos,
                         uint16_t Ypos,
                         uint16_t Radius )
{
    int32_t D;     /* Decision Variable */
    uint32_t CurX; /* Current X Value */
    uint32_t CurY; /* Current Y Value */

    D = 3 - ( Radius << 1 );

    CurX = 0;
    CurY = Radius;

    LCD_SetTextColor( BackColor );

    while( CurX <= CurY )
    {
        if( CurY > 0 )
        {
            LCD_DrawLine( Xpos - CurX, Ypos + CurY, 2 * CurY, LCD_DIR_HORIZONTAL );
            LCD_DrawLine( Xpos + CurX, Ypos + CurY, 2 * CurY, LCD_DIR_HORIZONTAL );
        }

        if( CurX > 0 )
        {
            LCD_DrawLine( Xpos - CurY, Ypos + CurX, 2 * CurX, LCD_DIR_HORIZONTAL );
            LCD_DrawLine( Xpos + CurY, Ypos + CurX, 2 * CurX, LCD_DIR_HORIZONTAL );
        }

        if( D < 0 )
        {
            D += ( CurX << 2 ) + 6;
        }
        else
        {
            D += ( ( CurX - CurY ) << 2 ) + 10;
            CurY--;
        }

        CurX++;
    }

    LCD_SetTextColor( TextColor );
    LCD_DrawCircle( Xpos, Ypos, Radius );
}

/**
 * @brief  Displays an uni line (between two points).
 * @param  x1: specifies the point 1 x position.
 * @param  y1: specifies the point 1 y position.
 * @param  x2: specifies the point 2 x position.
 * @param  y2: specifies the point 2 y position.
 * @retval None
 */
void LCD_DrawUniLine( uint16_t x1,
                      uint16_t y1,
                      uint16_t x2,
                      uint16_t y2 )
{
    int16_t deltax = 0, deltay = 0, x = 0, y = 0, xinc1 = 0, xinc2 = 0,
            yinc1 = 0, yinc2 = 0, den = 0, num = 0, numadd = 0, numpixels = 0,
            curpixel = 0;

    deltax = ABS( x2 - x1 );    /* The difference between the x's */
    deltay = ABS( y2 - y1 );    /* The difference between the y's */
    x = x1;                     /* Start x off at the first pixel */
    y = y1;                     /* Start y off at the first pixel */

    if( x2 >= x1 )              /* The x-values are increasing */
    {
        xinc1 = 1;
        xinc2 = 1;
    }
    else                        /* The x-values are decreasing */
    {
        xinc1 = -1;
        xinc2 = -1;
    }

    if( y2 >= y1 )              /* The y-values are increasing */
    {
        yinc1 = 1;
        yinc2 = 1;
    }
    else                        /* The y-values are decreasing */
    {
        yinc1 = -1;
        yinc2 = -1;
    }

    if( deltax >= deltay )      /* There is at least one x-value for every y-value */
    {
        xinc1 = 0;              /* Don't change the x when numerator >= denominator */
        yinc2 = 0;              /* Don't change the y for every iteration */
        den = deltax;
        num = deltax / 2;
        numadd = deltay;
        numpixels = deltax;     /* There are more x-values than y-values */
    }
    else                        /* There is at least one y-value for every x-value */
    {
        xinc2 = 0;              /* Don't change the x for every iteration */
        yinc1 = 0;              /* Don't change the y when numerator >= denominator */
        den = deltay;
        num = deltay / 2;
        numadd = deltax;
        numpixels = deltay;     /* There are more y-values than x-values */
    }

    for( curpixel = 0; curpixel <= numpixels; curpixel++ )
    {
        PutPixel( x, y );       /* Draw the current pixel */
        num += numadd;          /* Increase the numerator by the top of the fraction */

        if( num >= den )        /* Check if numerator >= denominator */
        {
            num -= den;         /* Calculate the new numerator value */
            x += xinc1;         /* Change the x as appropriate */
            y += yinc1;         /* Change the y as appropriate */
        }

        x += xinc2;             /* Change the x as appropriate */
        y += yinc2;             /* Change the y as appropriate */
    }
}

/**
 * @brief  Displays an polyline (between many points).
 * @param  Points: pointer to the points array.
 * @param  PointCount: Number of points.
 * @retval None
 */
void LCD_PolyLine( pPoint Points,
                   uint16_t PointCount )
{
    int16_t X = 0, Y = 0;

    if( PointCount < 2 )
    {
        return;
    }

    while( --PointCount )
    {
        X = Points->X;
        Y = Points->Y;
        Points++;
        LCD_DrawUniLine( X, Y, Points->X, Points->Y );
    }
}

/**
 * @brief  Displays an relative polyline (between many points).
 * @param  Points: pointer to the points array.
 * @param  PointCount: Number of points.
 * @param  Closed: specifies if the draw is closed or not.
 *           1: closed, 0 : not closed.
 * @retval None
 */
static void LCD_PolyLineRelativeClosed( pPoint Points,
                                        uint16_t PointCount,
                                        uint16_t Closed )
{
    int16_t X = 0, Y = 0;
    pPoint First = Points;

    if( PointCount < 2 )
    {
        return;
    }

    X = Points->X;
    Y = Points->Y;

    while( --PointCount )
    {
        Points++;
        LCD_DrawUniLine( X, Y, X + Points->X, Y + Points->Y );
        X = X + Points->X;
        Y = Y + Points->Y;
    }

    if( Closed )
    {
        LCD_DrawUniLine( First->X, First->Y, X, Y );
    }
}

/**
 * @brief  Displays a closed polyline (between many points).
 * @param  Points: pointer to the points array.
 * @param  PointCount: Number of points.
 * @retval None
 */
void LCD_ClosedPolyLine( pPoint Points,
                         uint16_t PointCount )
{
    LCD_PolyLine( Points, PointCount );
    LCD_DrawUniLine( Points->X, Points->Y, ( Points + PointCount - 1 )->X, ( Points + PointCount - 1 )->Y );
}

/**
 * @brief  Displays a relative polyline (between many points).
 * @param  Points: pointer to the points array.
 * @param  PointCount: Number of points.
 * @retval None
 */
void LCD_PolyLineRelative( pPoint Points,
                           uint16_t PointCount )
{
    LCD_PolyLineRelativeClosed( Points, PointCount, 0 );
}

/**
 * @brief  Displays a closed relative polyline (between many points).
 * @param  Points: pointer to the points array.
 * @param  PointCount: Number of points.
 * @retval None
 */
void LCD_ClosedPolyLineRelative( pPoint Points,
                                 uint16_t PointCount )
{
    LCD_PolyLineRelativeClosed( Points, PointCount, 1 );
}


/**
 * @brief  Displays a  full polyline (between many points).
 * @param  Points: pointer to the points array.
 * @param  PointCount: Number of points.
 * @retval None
 */
void LCD_FillPolyLine( pPoint Points,
                       uint16_t PointCount )
{
    /*  public-domain code by Darel Rex Finley, 2007 */
    uint16_t nodes = 0, nodeX[ MAX_POLY_CORNERS ], pixelX = 0, pixelY = 0, i = 0,
             j = 0, swap = 0;
    uint16_t IMAGE_LEFT = 0, IMAGE_RIGHT = 0, IMAGE_TOP = 0, IMAGE_BOTTOM = 0;

