FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_IAR/system_and_ST_code/STM32L152_EVAL/stm32l152_eval_lcd.c
    IMAGE_LEFT = IMAGE_RIGHT = Points->X;
    IMAGE_TOP = IMAGE_BOTTOM = Points->Y;

    for( i = 1; i < PointCount; i++ )
    {
        pixelX = POLY_X( i );

        if( pixelX < IMAGE_LEFT )
        {
            IMAGE_LEFT = pixelX;
        }

        if( pixelX > IMAGE_RIGHT )
        {
            IMAGE_RIGHT = pixelX;
        }

        pixelY = POLY_Y( i );

        if( pixelY < IMAGE_TOP )
        {
            IMAGE_TOP = pixelY;
        }

        if( pixelY > IMAGE_BOTTOM )
        {
            IMAGE_BOTTOM = pixelY;
        }
    }

    LCD_SetTextColor( BackColor );

    /*  Loop through the rows of the image. */
    for( pixelY = IMAGE_TOP; pixelY < IMAGE_BOTTOM; pixelY++ )
    {
        /* Build a list of nodes. */
        nodes = 0;
        j = PointCount - 1;

        for( i = 0; i < PointCount; i++ )
        {
            if( ( POLY_Y( i ) < ( double ) pixelY ) && ( POLY_Y( j ) >= ( double ) pixelY ) || ( POLY_Y( j ) < ( double ) pixelY ) && ( POLY_Y( i ) >= ( double ) pixelY ) )
            {
                nodeX[ nodes++ ] = ( int ) ( POLY_X( i ) + ( ( pixelY - POLY_Y( i ) ) * ( POLY_X( j ) - POLY_X( i ) ) ) / ( POLY_Y( j ) - POLY_Y( i ) ) );
            }

            j = i;
        }

        /* Sort the nodes, via a simple “Bubble” sort. */
        i = 0;

        while( i < nodes - 1 )
        {
            if( nodeX[ i ] > nodeX[ i + 1 ] )
            {
                swap = nodeX[ i ];
                nodeX[ i ] = nodeX[ i + 1 ];
                nodeX[ i + 1 ] = swap;

                if( i )
                {
                    i--;
                }
            }
            else
            {
                i++;
            }
        }

        /*  Fill the pixels between node pairs. */
        for( i = 0; i < nodes; i += 2 )
        {
            if( nodeX[ i ] >= IMAGE_RIGHT )
            {
                break;
            }

            if( nodeX[ i + 1 ] > IMAGE_LEFT )
            {
                if( nodeX[ i ] < IMAGE_LEFT )
                {
                    nodeX[ i ] = IMAGE_LEFT;
                }

                if( nodeX[ i + 1 ] > IMAGE_RIGHT )
                {
                    nodeX[ i + 1 ] = IMAGE_RIGHT;
                }

                LCD_SetTextColor( BackColor );
                LCD_DrawLine( pixelY, nodeX[ i + 1 ], nodeX[ i + 1 ] - nodeX[ i ], LCD_DIR_HORIZONTAL );
                LCD_SetTextColor( TextColor );
                PutPixel( pixelY, nodeX[ i + 1 ] );
                PutPixel( pixelY, nodeX[ i ] );
                /* for (j=nodeX[i]; j<nodeX[i+1]; j++) PutPixel(j,pixelY); */
            }
        }
    }

    /* draw the edges */
    LCD_SetTextColor( TextColor );
}

/**
 * @brief  Reset LCD control line(/CS) and Send Start-Byte
 * @param  Start_Byte: the Start-Byte to be sent
 * @retval None
 */
void LCD_nCS_StartByte( uint8_t Start_Byte )
{
    LCD_CtrlLinesWrite( LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_RESET );

    SPI_SendData( LCD_SPI, Start_Byte );

    while( SPI_GetFlagStatus( LCD_SPI, SPI_FLAG_BSY ) != RESET )
    {
    }
}


/**
 * @brief  Writes index to select the LCD register.
 * @param  LCD_Reg: address of the selected register.
 * @retval None
 */
void LCD_WriteRegIndex( uint8_t LCD_Reg )
{
    /* Reset LCD control line(/CS) and Send Start-Byte */
    LCD_nCS_StartByte( START_BYTE | SET_INDEX );

    /* Write 16-bit Reg Index (High Byte is 0) */
    SPI_SendData( LCD_SPI, 0x00 );

    while( SPI_GetFlagStatus( LCD_SPI, SPI_FLAG_BSY ) != RESET )
    {
    }

    SPI_SendData( LCD_SPI, LCD_Reg );

    while( SPI_GetFlagStatus( LCD_SPI, SPI_FLAG_BSY ) != RESET )
    {
    }

    LCD_CtrlLinesWrite( LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET );
}


/**
 * @brief  Writes to the selected LCD ILI9320 register.
 * @param  LCD_Reg: address of the selected register.
 * @param  LCD_RegValue: value to write to the selected register.
 * @retval None
 */
void LCD_WriteReg( uint8_t LCD_Reg,
                   uint16_t LCD_RegValue )
{
    /* Write 16-bit Index (then Write Reg) */
    LCD_WriteRegIndex( LCD_Reg );

    /* Write 16-bit Reg */
    /* Reset LCD control line(/CS) and Send Start-Byte */
    LCD_nCS_StartByte( START_BYTE | LCD_WRITE_REG );

    SPI_SendData( LCD_SPI, LCD_RegValue >> 8 );

    while( SPI_GetFlagStatus( LCD_SPI, SPI_FLAG_BSY ) != RESET )
    {
    }

    SPI_SendData( LCD_SPI, ( LCD_RegValue & 0xFF ) );

    while( SPI_GetFlagStatus( LCD_SPI, SPI_FLAG_BSY ) != RESET )
    {
    }

    LCD_CtrlLinesWrite( LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET );
}


/**
 * @brief  Reads the selected LCD Register.
 * @param  LCD_Reg: address of the selected register.
 * @retval LCD Register Value.
 */
uint16_t LCD_ReadReg( uint8_t LCD_Reg )
{
    uint16_t tmp = 0;
    uint8_t i = 0;

    /* LCD_SPI prescaler: 4 */
    LCD_SPI->CR1 &= 0xFFC7;
    LCD_SPI->CR1 |= 0x0008;
    /* Write 16-bit Index (then Read Reg) */
    LCD_WriteRegIndex( LCD_Reg );
    /* Read 16-bit Reg */
    /* Reset LCD control line(/CS) and Send Start-Byte */
    LCD_nCS_StartByte( START_BYTE | LCD_READ_REG );

    for( i = 0; i < 5; i++ )
    {
        SPI_SendData( LCD_SPI, 0xFF );

        while( SPI_GetFlagStatus( LCD_SPI, SPI_FLAG_BSY ) != RESET )
        {
        }

        /* One byte of invalid dummy data read after the start byte */
        while( SPI_GetFlagStatus( LCD_SPI, SPI_FLAG_RXNE ) == RESET )
        {
        }

        SPI_ReceiveData( LCD_SPI );
    }

    SPI_SendData( LCD_SPI, 0xFF );

    /* Read upper byte */
    while( SPI_GetFlagStatus( LCD_SPI, SPI_FLAG_BSY ) != RESET )
    {
    }

    /* Read lower byte */
    while( SPI_GetFlagStatus( LCD_SPI, SPI_FLAG_RXNE ) == RESET )
    {
    }

    tmp = SPI_ReceiveData( LCD_SPI );


    SPI_SendData( LCD_SPI, 0xFF );

    while( SPI_GetFlagStatus( LCD_SPI, SPI_FLAG_BSY ) != RESET )
    {
    }

    /* Read lower byte */
    while( SPI_GetFlagStatus( LCD_SPI, SPI_FLAG_RXNE ) == RESET )
    {
    }

    tmp = ( ( tmp & 0xFF ) << 8 ) | SPI_ReceiveData( LCD_SPI );
    LCD_CtrlLinesWrite( LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET );

    /* LCD_SPI prescaler: 2 */
    LCD_SPI->CR1 &= 0xFFC7;

    return tmp;
}


/**
 * @brief  Prepare to write to the LCD RAM.
 * @param  None
 * @retval None
 */
void LCD_WriteRAM_Prepare( void )
{
    LCD_WriteRegIndex( LCD_REG_34 ); /* Select GRAM Reg */

