FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_STM32L152_IAR/system_and_ST_code/STM32L152_EVAL/stm32l152_eval_lcd.c
    /* Reset LCD control line(/CS) and Send Start-Byte */
    LCD_nCS_StartByte( START_BYTE | LCD_WRITE_REG );
}


/**
 * @brief  Writes 1 word to the LCD RAM.
 * @param  RGB_Code: the pixel color in RGB mode (5-6-5).
 * @retval None
 */
void LCD_WriteRAMWord( uint16_t RGB_Code )
{
    LCD_WriteRAM_Prepare();

    LCD_WriteRAM( RGB_Code );

    LCD_CtrlLinesWrite( LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET );
}

/**
 * @brief  Writes to the LCD RAM.
 * @param  RGB_Code: the pixel color in RGB mode (5-6-5).
 * @retval None
 */
void LCD_WriteRAM( uint16_t RGB_Code )
{
    SPI_SendData( LCD_SPI, RGB_Code >> 8 );

    while( SPI_GetFlagStatus( LCD_SPI, SPI_FLAG_BSY ) != RESET )
    {
    }

    SPI_SendData( LCD_SPI, RGB_Code & 0xFF );

    while( SPI_GetFlagStatus( LCD_SPI, SPI_FLAG_BSY ) != RESET )
    {
    }
}


/**
 * @brief  Power on the LCD.
 * @param  None
 * @retval None
 */
void LCD_PowerOn( void )
{
    /* Power On sequence ---------------------------------------------------------*/
    LCD_WriteReg( LCD_REG_16, 0x0000 ); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
    LCD_WriteReg( LCD_REG_17, 0x0000 ); /* DC1[2:0], DC0[2:0], VC[2:0] */
    LCD_WriteReg( LCD_REG_18, 0x0000 ); /* VREG1OUT voltage */
    LCD_WriteReg( LCD_REG_19, 0x0000 ); /* VDV[4:0] for VCOM amplitude */
    _delay_( 20 );                      /* Dis-charge capacitor power voltage (200ms) */
    LCD_WriteReg( LCD_REG_16, 0x17B0 ); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
    LCD_WriteReg( LCD_REG_17, 0x0137 ); /* DC1[2:0], DC0[2:0], VC[2:0] */
    _delay_( 5 );                       /* Delay 50 ms */
    LCD_WriteReg( LCD_REG_18, 0x0139 ); /* VREG1OUT voltage */
    _delay_( 5 );                       /* delay 50 ms */
    LCD_WriteReg( LCD_REG_19, 0x1d00 ); /* VDV[4:0] for VCOM amplitude */
    LCD_WriteReg( LCD_REG_41, 0x0013 ); /* VCM[4:0] for VCOMH */
    _delay_( 5 );                       /* delay 50 ms */
    LCD_WriteReg( LCD_REG_7, 0x0173 );  /* 262K color and display ON */
}


/**
 * @brief  Enables the Display.
 * @param  None
 * @retval None
 */
void LCD_DisplayOn( void )
{
    /* Display On */
    LCD_WriteReg( LCD_REG_7, 0x0173 ); /* 262K color and display ON */
}


/**
 * @brief  Disables the Display.
 * @param  None
 * @retval None
 */
void LCD_DisplayOff( void )
{
    /* Display Off */
    LCD_WriteReg( LCD_REG_7, 0x0 );
}


/**
 * @brief  Configures LCD control lines in Output Push-Pull mode.
 * @param  None
 * @retval None
 */
void LCD_CtrlLinesConfig( void )
{
    GPIO_InitTypeDef GPIO_InitStructure;

    RCC_AHBPeriphClockCmd( LCD_NCS_GPIO_CLK, ENABLE );

    /* Configure NCS (PF.02) in Output Push-Pull mode */
    GPIO_InitStructure.GPIO_Pin = LCD_NCS_PIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_Init( LCD_NCS_GPIO_PORT, &GPIO_InitStructure );

    LCD_CtrlLinesWrite( LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET );
}


/**
 * @brief  Sets or reset LCD control lines.
 * @param  GPIOx: where x can be B or D to select the GPIO peripheral.
 * @param  CtrlPins: the Control line.
 *   This parameter can be:
 *     @arg LCD_NCS_PIN: Chip Select pin
 *     @arg LCD_NWR_PIN: Read/Write Selection pin
 *     @arg LCD_RS_PIN: Register/RAM Selection pin
 * @param  BitVal: specifies the value to be written to the selected bit.
 *   This parameter can be:
 *     @arg Bit_RESET: to clear the port pin
 *     @arg Bit_SET: to set the port pin
 * @retval None
 */
void LCD_CtrlLinesWrite( GPIO_TypeDef * GPIOx,
                         uint16_t CtrlPins,
                         BitAction BitVal )
{
    /* Set or Reset the control line */
    GPIO_WriteBit( GPIOx, CtrlPins, BitVal );
}


/**
 * @brief  Configures the LCD_SPI interface.
 * @param  None
 * @retval None
 */
void LCD_SPIConfig( void )
{
    SPI_InitTypeDef SPI_InitStructure;
    GPIO_InitTypeDef GPIO_InitStructure;

    /* Enable LCD_SPI_SCK_GPIO_CLK, LCD_SPI_MISO_GPIO_CLK and LCD_SPI_MOSI_GPIO_CLK clock */
    RCC_AHBPeriphClockCmd( LCD_SPI_SCK_GPIO_CLK | LCD_SPI_MISO_GPIO_CLK | LCD_SPI_MOSI_GPIO_CLK, ENABLE );

    /* Enable LCD_SPI and SYSCFG clock  */
    RCC_APB2PeriphClockCmd( LCD_SPI_CLK | RCC_APB2Periph_SYSCFG, ENABLE );

    /* Configure LCD_SPI SCK pin */
    GPIO_InitStructure.GPIO_Pin = LCD_SPI_SCK_PIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_40MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
    GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_Init( LCD_SPI_SCK_GPIO_PORT, &GPIO_InitStructure );

    /* Configure LCD_SPI MISO pin */
    GPIO_InitStructure.GPIO_Pin = LCD_SPI_MISO_PIN;
    GPIO_Init( LCD_SPI_MISO_GPIO_PORT, &GPIO_InitStructure );

    /* Configure LCD_SPI MOSI pin */
    GPIO_InitStructure.GPIO_Pin = LCD_SPI_MOSI_PIN;
    GPIO_Init( LCD_SPI_MOSI_GPIO_PORT, &GPIO_InitStructure );

    /* Connect PE.13 to SPI SCK */
    GPIO_PinAFConfig( LCD_SPI_SCK_GPIO_PORT, LCD_SPI_SCK_SOURCE, LCD_SPI_SCK_AF );

    /* Connect PE.14 to SPI MISO */
    GPIO_PinAFConfig( LCD_SPI_MISO_GPIO_PORT, LCD_SPI_MISO_SOURCE, LCD_SPI_MISO_AF );

    /* Connect PE.15 to SPI MOSI */
    GPIO_PinAFConfig( LCD_SPI_MOSI_GPIO_PORT, LCD_SPI_MOSI_SOURCE, LCD_SPI_MOSI_AF );

    SPI_DeInit( LCD_SPI );

    /* SPI Config */
    SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
    SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
    SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
    SPI_InitStructure.SPI_CPOL = SPI_CPOL_High;
    SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
    SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
    SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_2;
    SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
    SPI_InitStructure.SPI_CRCPolynomial = 7;
    SPI_Init( LCD_SPI, &SPI_InitStructure );

    /* SPI enable */
    SPI_Cmd( LCD_SPI, ENABLE );
}

/**
 * @brief  Displays a pixel.
 * @param  x: pixel x.
 * @param  y: pixel y.
 * @retval None
 */
static void PutPixel( int16_t x,
                      int16_t y )
{
    if( ( x < 0 ) || ( x > 239 ) || ( y < 0 ) || ( y > 319 ) )
    {
        return;
    }

    LCD_DrawLine( x, y, 1, LCD_DIR_HORIZONTAL );
}

#ifndef USE_Delay

/**
 * @brief  Inserts a delay time.
 * @param  nCount: specifies the delay time length.
 * @retval None
 */
    static void delay( __IO uint32_t nCount )
    {
        __IO uint32_t index = 0;

        for( index = ( 34000 * nCount ); index != 0; index-- )
        {
        }
    }
#endif /* USE_Delay*/

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/******************* (C) COPYRIGHT 2010 STMicroelectronics *****END OF FILE****/
